import React from "react";
import "./Drones.css"; // Assuming your custom CSS file is named Drones.css

const Drones = () => {
  return (
    <div className="drone-container w-full h-full">
      <div className="imageContainer">
        <img src="./drones/dro1.jpg" alt="Drone" className="image" />
        <h1 className="title" style={{ marginTop: "60px" }}>اَلطَّائِرَاتِ اَلْمَسِيرَةِ</h1>
      </div>
      <div className="content1">
        <div className="drone-section  section1">
          <div className="contentWithImage">
            <h2 className="sectionTitle">:خِدْمَات بَيْعِ وَتَأْجِيرِ اَلطَّائِرَاتِ اَلْمَسِيرَةِ</h2>
            <p className="description">
            ". اِنْطَلَقَ فِي رِحْلَةٍ مُبْهِجَةٍ إِلَى اَلسَّمَاءِ مَعَ خِدْمَاتِنَا اَلرَّائِدَةِ فِي مَجَالِ بَيْعِ وَتَأْجِيرِ اَلطَّائِرَاتِ دُونَ طَيَّارٍ، حَيْثُ تُمَثِّلُ كُلَّ رِحْلَةِ مُغَامَرَةٍ تَنْتَظِرُ اِكْتِشَافَهَا "
            </p>
            <p className="text">
           <div> اِكْتَشَفَ اَلْوُجْهَةَ اَلنِّهَائِيَّةَ لِعُشَّاقِ اَلطَّائِرَاتِ دُونَ طَيَّارِ وَالْمُحْتَرِفِينَ عَلَى حَدٍّ سَوَاءٍ - خِدْمَاتُنَا اَلشَّامِلَةُ لِبَيْعِ وَتَأْجِيرِ اَلطَّائِرَاتِ دُونَ طَيَّارٍ تُعَمِّقُ فِي مَخْزُونِنَا اَلْمُتَنَوِّعِ اَلَّذِي يَضُمُّ طَائِرَاتٍ دُونَ طَيَّارٍ عَلَى مُسْتَوَى اَلْمُؤَسَّسَاتِ تَمَّ اِخْتِيَارُهَا بِدِقَّةِ لِجَوْدَتِهَا وَأَدَائِهَا وَالْقُدْرَةِ عَلَى تَحَمُّلِ اَلتَّكَالِيفِ. سَوَاءً كُنْتُ تَسْعَى لِامْتِلَاكِ طَائِرَةٍ دُونَ طَيَّارِ بِالْكَامِلِ أَوْ تَحْتَاجُ إِلَى وَاحِدَةٍ لِمَشْرُوعٍ مُعَيَّنٍ، فَإِنَّ اَلنُّخْبَةَ تُلَبِّي اِحْتِيَاجَاتِكَ بِمُرُونَةٍ لَا مَثِيلَ لَهَا وَأَسْعَارُ تَنَافُسِيَّةٍ.</div>

 <div>إِنَّ اِلْتِزَامَنَا بِرِضَا اَلْعُمَلَاءِ لَا يَتَزَعْزَعُ، وَهُوَ مَا يَنْعَكِسُ فِي تَوْجِيهَاتِ خُبَرَائِنَا وَخِدْمَةِ اَلْعُمَلَاءِ اَلِاسْتِثْنَائِيَّةِ. مِنْ أَبْرَزِ اَلشَّرِكَاتِ اَلْمُصَنَّعَةِ، نُقَدِّمُ أَفْضَلُ اَلطَّائِرَاتِ دُونَ طَيَّارِ اَلْمُجَهَّزَةِ بِأَحْدَثِ اَلتِّقْنِيَّاتِ لِلِارْتِقَاءِ بِمَسَاعِيكَ اَلْجَوِّيَّة. سَوَاءً كُنْتُ تَلْتَقِطُ لَقَطَاتٍ مُذْهِلَةً، أَوْ تَجْرِي مُسُوحَاتٍ أَوْ اِسْتِطْلَاعَاتٍ، أَوْ تَفَحُّصِ اَلْأُصُولِ، فَإِنَّ طَائِرَاتِنَا دُونَ طَيَّارِ تَوَفُّرِ دِقَّةٍ ومُوثُوقِيَّة لَا مَثِيلَ لَهُمَا.</div>
<div>
اِسْتَمْتَعَ بِتَجْرِبَةِ اَلرَّاحَةِ اَلَّتِي تُوَفِّرُهَا خِيَارَاتُ اَلتَّأْجِيرِ اَلْمَرِنَةِ لَدَيْنَا، مِمَّا يُوَفِّرُ إِمْكَانِيَّةَ اَلْوُصُولِ إِلَى أَحْدَثِ تِقْنِيَّاتِ اَلطَّائِرَاتِ دُونَ طَيَّارٍ دُونَ إِجْهَادِ مِيزَانِيَّتِكَ سَوَاءٌ كُنْتُ مُحْتَرِفًا مُتَمَرِّسًا أَوْ مُتَحَمِّسًا مُبْتَدِئًا، فَنَحْنُ مُلْتَزِمُونَ بِأَنْ نَكُونَ شَرِيكَكَ اَلْمَوْثُوقَ بِهِ فِي كُلِّ مَا يَتَعَلَّقُ بِالطَّائِرَاتِ دُونَ طَيَّارٍ. أَرْفَعُ مُسْتَوَى تَوَقُّعَاتِكَ وَاسْتَكْشَفَ اَلْإِمْكَانَاتِ مَعَنَا - وُجْهَتُكَ اَلشَّامِلَةُ لِجَمِيعِ اِحْتِيَاجَاتِ طَائِرَاتِكَ دُونَ طَيَّارٍ.</div>
            </p>
          </div>
          <div className="imageRight">
            <img
              src="./drones/service1.jpg"
              alt="Service 1"
              className="image"
            />
          </div>
        </div>

        <div className="drone-section section2">
          <div className="contentWithImage">
            <h2 className="sectionTitle">:اَلْمَسْح اَلْجَوِّيِّ وَرَسْمِ اَلْخَرَائِطِ بِالطَّائِرَاتِ دُونَ طَيَّارِ</h2>
            <p className="description">
            " أَرْفَعِ مُسْتَوَى أَعْمَالِكَ مِنْ خِلَالِ خِدْمَاتِ اَلْمَسْحِ اَلْجَوِّيِّ وَرَسْمِ اَلْخَرَائِطِ اَلْمُتَقَدِّمَةِ بِطَائِرَاتٍ دُونَ طَيَّارٍ، حَيْثُ يَلْتَقِي اَلِابْتِكَارُ بِالدِّقَّةِ لِلْحُصُولِ عَلَى نَتَائِجَ لَا مَثِيلَ لَهَا "
            </p>
            <p className="text">
           <div> مَسْبُوقَةٍ - مِنْ اَلنَّجَاحِ. مِنْ خِلَالِ تَسْخِيرِ اَلْقُدُرَاتِ اَلْمُتَطَوِّرَةِ لِتِقْنِيَّةِ اَلطَّائِرَاتِ دُونَ طَيَّارٍ، فَإِنَّنَا نُعِيدُ تَعْرِيفُ مَشْهَدِ طُرُقِ اَلْمَسْحِ اَلتَّقْلِيدِيَّةِ، مِمَّا يَضْمَنُ دِقَّةَ وَتَفَاصِيلَ لَا مَثِيلَ لَهَا فِي كُلِّ خَرِيطَةٍ نَقُومُ بِإِنْشَائِهَا. قَلَّ وَدَاعًا لِقُيُودِ اَلتِّقْنِيَّاتِ اَلتَّقْلِيدِيَّةِ وَاحْتَضَنَ مُسْتَقْبَلاً حَيْثُ يَتِمُّ تَحْسِينَ اَلْوَقْتِ وَالْمَوَارِدِ إِلَى أَقْصَى إِمْكَانَاتِهَا، وَمُصَمَّمَةٌ خِصِّيصًا لِتَلْبِيَةِ اِحْتِيَاجَاتِكَ اَلْمُتَطَوِّرَةِ بِدِقَّةِ لَا مَثِيلَ لَهَا وَفَعَّالِيَّةٌ مِنْ حَيْثُ اَلتَّكْلِفَةُ.</div>
<div>
يُسْتَخْدَم فَرِيقُ اَلْخُبَرَاءِ اَلْمُتَمَرِّسِ لَدَيْنَا طَائِرَاتٌ دُونَ طَيَّارٍ حَدِيثَةٍ وَمُجَهَّزَةٍ بِأَجْهِزَةِ اِسْتِشْعَارِ وَكَامِيرَاتِ مُتَقَدِّمَةٍ لِالْتِقَاطِ صُوَرٍ جَوِّيَّةٍ شَامِلَةٍ لِمِنْطَقَةِ اِهْتِمَامِكَ. وَمِنْ هَذِهِ اَلْبَيَانَاتِ، نَقُومُ بِصِيَاغَةِ خَرَائِطَ تَفْصِيلِيَّةٍ بِدِقَّةِ تَوَفُّرَ رُؤًى لَا تُقَدَّرُ بِثَمَنٍ وَتُفِيدُ عَمَلِيَّاتُ صُنْعِ اَلْقَرَارِ اَلْاِسْتِرَاتِيجِيِّ. سَوَاءً كُنْتُ تَقُومُ بِمُرَاقَبَةِ تَقَدُّمِ اَلْمَشْرُوعِ، أَوْ تَحْلِيلِ مِيزَاتِ اَلتَّضَارِيسِ، أَوْ تَقْيِيمِ اَلتَّأْثِيرِ اَلْبِيئِيِّ، فَإِنَّ خَرَائِطَنَا تَعْتَبِرُ اَلدَّلِيلَ اَلْأَمْثَلَ لَكَ فِي وَسَطِ تَعْقِيدَاتِ اَلْمَنَاظِرِ اَلطَّبِيعِيَّةِ لِلْأَعْمَالِ اَلْحَدِيثَةِ.
</div><div>
إِنَّ اِخْتِيَارَ خِدْمَاتِ اَلْمَسْحِ اَلْجَوِّيِّ بِاسْتِخْدَامِ اَلطَّائِرَاتِ دُونَ طَيَّارٍ لَا يَقْتَصِرُ فَقَطْ عَلَى اَلْحُصُولِ عَلَى اَلْخَرَائِطِ - بَلْ يَتَعَلَّقُ أَيْضًا بِالِاسْتِثْمَارِ فِي اَلْكَفَاءَةِ وَالدِّقَّةِ، وَفِي نِهَايَةِ اَلْمَطَافِ، اِزْدِهَارُ مُؤَسَّسَتِكَ. اِنْضَمَّ إِلَى صُفُوفِ قَادَةِ اَلصِّنَاعَةِ اَلَّذِينَ تَبَنَّوْا مُسْتَقْبَلُ اَلْمَسْحِ، وَدَّعَنَا نُرْشَدكُ نَحْو نَجَاحِ اَلَّذِي لَا يَعْرِفُ حُدُودًا. اِسْتَمْتَعَ بِتَجْرِبَةِ اَلْقُوَّةِ اَلتَّحْوِيلِيَّةِ لِلْمَسْحِ اَلْجَوِّيِّ وَرَسْمِ اَلْخَرَائِطِ بِاسْتِخْدَامِ اَلطَّائِرَاتِ دُونَ طَيَّارٍ، حَيْثُ تَجْتَمِعُ اَلدِّقَّةُ مَعَ اَلِابْتِكَارِ، وَإِمْكَانِيَّةُ اَلنَّجَاحِ لَا تَعْرِفُ حُدُودًا. تَوَاصُلُ مَعَنَا اَلْيَوْمَ لِتَكْتَشِفَ كَيْفَ يُمْكِنُنَا تَصْمِيمُ خِدْمَاتِنَا لِتَتَوَافَقَ بِسَلَاسَةٍ مَعَ أَهْدَافِكَ اَلْفَرِيدَةِ، وَدَفْعَ عَمَلِكَ نَحْوَ مُسْتَوَيَاتٍ أَعْلَى مِنْ اَلْإِنْجَازِ.
</div>      </p>
          </div>
          <div className="imageRight">
            <img
              src="./drones/service2.jpg"
              alt="Service 2"
              className="image"
            />
          </div>
        </div>

        <div className="drone-section section3">
          <div className="contentWithImage">
            <h2 className="sectionTitle">:
            اَلتَّفْتِيش وَالتَّحْلِيلِ اَلْجَوِّيِّ لِلطَّائِرَاتِ دُونَ طَيَّارٍ
            </h2>
            <p className="description">
            " اِخْتَبَرَ أَحْدَثُ تِقْنِيَّاتِ فَحْصِ اَلْأُصُولِ مِنْ خِلَالِ خِدْمَاتِ اَلطَّائِرَاتِ دُونَ طَيَّارِ لَدَيْنَا، حَيْثُ تَلْتَقِي اَلسَّلَامَةُ وَالْكَفَاءَةُ وَالدِّقَّةُ لِإِعَادَةِ تَحْدِيدِ مَعَايِيرِ اَلصِّنَاعَةِ "
            </p>
            <p className="text">
              <div>
            اِكْتَشَفَ مُسْتَقْبَلُ فَحْصِ اَلْأُصُولِ مِنْ خِلَالِ خِدْمَاتِ فَحْصِ وَتَحْلِيلِ اَلطَّائِرَاتِ دُونَ طَيَّارٍ. تَمَّ تَجْهِيزُ طَائِرَاتِنَا دُونَ طَيَّارٍ بِكَامِيرَاتِ وَأَجْهِزَةِ اِسْتِشْعَارٍ عَالِيَةٍ اَلدِّقَّةِ لِتَزْوِيدِكَ بِرُؤًى مَرْئِيَّةٍ وَبَيَانَاتِ تَفْصِيلِيَّةٍ حَوْلَ أُصُولِكَ. مِنْ اَلْبِنْيَةِ اَلتَّحْتِيَّةِ وَالْمَبَانِي إِلَى خُطُوطِ اَلْأَنَابِيبِ وَخُطُوطِ اَلْكَهْرَبَاءِ، تُوَفِّرَ عَمَلِيَّاتِ فَحْصِ اَلطَّائِرَاتِ دُونَ طَيَّارِ لَدَيْنَا كَفَاءَةٌ مُحَسَّنَةٌ، وَمَزِيدًا مِنْ اَلسَّلَامَةِ، وَتَقْلِيلَ اَلْمَخَاطِرِ.
            </div><div>
قَلَّ وَدَاعًا لِعَمَلِيَّاتِ اَلتَّفْتِيشِ اَلْيَدَوِيَّةِ وَمَرْحَبًا بِحَلِّ أَكْثَرِ ذَكَاءٍ وَأَمَانٍ وَفَعَّالِيَّةٍ مِنْ حَيْثُ اَلتَّكْلِفَةُ مِنْ خِلَالِ خِدْمَاتِ اَلْفَحْصِ اَلْجَوِّيِّ بِاسْتِخْدَامِ اَلطَّائِرَاتِ دُونَ طَيَّارٍ. يَسْتَفِيدَ فَرِيقُ اَلْخُبَرَاءِ اَلْمُتَمَرِّسِ لَدَيْنَا مِنْ أَحْدَثِ اَلتَّطَوُّرَاتِ فِي تِقْنِيَّةِ اَلطَّائِرَاتِ دُونَ طَيَّارٍ لِإِجْرَاءِ عَمَلِيَّاتِ تَفْتِيشٍ شَامِلَةٍ بِدِقَّةٍ وَسُرْعَةٍ لَا مَثِيلَ لَهُمَا. مِنْ خِلَالِ اَلْقَضَاءِ عَلَى اَلْحَاجَةِ إِلَى اَلْعَمَلِ اَلْيَدَوِيِّ وَتَقْلِيلِ اَلْأَخْطَاءِ اَلْبَشَرِيَّةِ، فَإِنَّ عَمَلِيَّاتِ فَحْصِ اَلطَّائِرَاتِ دُونَ طَيَّارِ لَدَيْنَا لَا تُوَفِّرُ لَكَ اَلْوَقْتُ وَالْمَالُ فَحَسْبَ، بَلْ تُخَفِّفُ أَيْضًا مِنْ اَلْمَخَاطِرِ اَلْمُحْتَمَلَةِ اَلْمُرْتَبِطَةِ بِالطُّرُقِ اَلتَّقْلِيدِيَّةِ.
</div><div>
عِلَاوَةٌ عَلَى ذَلِكَ، تَوَفُّرُ عَمَلِيَّاتِ فَحْصِ اَلطَّائِرَاتِ دُونَ طَيَّارِ لَدَيْنَا مُسْتَوَى مِنْ اَلتَّفَاصِيلِ وَالرُّؤْيَةِ اَلَّتِي لَا يُمْكِنُ تَحْقِيقُهَا بِبَسَاطَةِ مِنْ خِلَالِ اَلْوَسَائِلِ اَلْيَدَوِيَّةِ. بَدَأَ مِنْ تَحْدِيدِ اَلْعُيُوبِ اَلْهَيْكَلِيَّةِ وَأَعْطَالِ اَلْمُعَدَّاتِ وَحَتَّى اِكْتِشَافِ اَلْمَخَاطِرِ اَلْمُحْتَمَلَةِ وَالِانْتِهَاكَاتِ اَلْأَمْنِيَّةِ، تُوَفِّرَ طَائِرَاتِنَا دُونَ طَيَّارِ رُؤْيَةٍ شَامِلَةٍ لِأُصُولِكَ، مِمَّا يُمْكِنُكَ مِنْ اِتِّخَاذِ قَرَارَاتٍ مُسْتَنِيرَةٍ بِثِقَةٍ.
</div>      </p>
          </div>
          <div className="imageRight">
            <img
              src="./drones/service3.jpg"
              alt="Service 3"
              className="image"
            />
          </div>
        </div>

        <div className="drone-section section4">
          <div className="contentWithImage">
            <h2 className="sectionTitle">:اِسْتِخْدَامُ اَلْمَسِيرَاتِ لِتَصْوِيرِ اَلْفِيدْيُو وَالْفُوتُوغْرَافِيِّ</h2>
            <p className="description">
            "ارفع مستوى صورك من خلال التصوير الفوتوغرافي بالفيديو والتصوير الفوتوغرافي بطائرات بدون طيار
              خدمات. من العقارات إلى الفعاليات، يقوم فريقنا الماهر بالتوصيل
              لقطات آسرة تميزك."
            </p>
            <p className="text"><div>
            أَرْفَعَ مُسْتَوَى صُوَرِكَ مَعَ خِدْمَاتِ اَلتَّصْوِيرِ اَلْفُوتُوغْرَافِيِّ بِالْفِيدْيُو وَالتَّصْوِيرِ اَلْفُوتُوغْرَافِيِّ بِاسْتِخْدَامِ اَلطَّائِرَاتِ دُونَ طَيَّارٍ بَدَأَ مِنْ اَلْعَقَارَاتِ وَحَتَّى اَلْأَحْدَاثِ، يُقَدِّمَ فَرِيقُنَا اَلْمَاهِرُ لَقَطَاتٍ جَذَّابَةً تُمَيِّزُكَ عَنْ اَلْآخَرِينَ
            </div><div>
أَرْفَعَ مُسْتَوَى اَلْعَرْضِ اَلْمَرْئِيِّ لِشَرِكَتِكَ مِنْ خِلَالِ خِدْمَاتِ اَلتَّصْوِيرِ اَلْفُوتُوغْرَافِيِّ بِالْفِيدْيُو وَالتَّصْوِيرِ اَلْفُوتُوغْرَافِيِّ بِطَائِرَاتٍ دُونَ طَيَّارِ اَلِاحْتِرَافِيَّةِ، وَالْمُصَمِّمَةُ خِصِّيصًا لِالْتِقَاطِ صُوَرٍ جَوِّيَّةٍ مُذْهِلَةٍ تَتْرُكُ اِنْطِبَاعًا دَائِمًا. سَوَاءً كُنْتُ تَعَرُّضَ اَلْعَقَارَاتِ، أَوْ تُرَوِّجُ لِلْأَحْدَاثِ، أَوْ تُنْشِئُ مُحْتَوًى تَسْوِيقِيًّا جَذَّابًا، فَإِنَّ طَائِرَاتِنَا دُونَ طَيَّارِ وَالْمُصَوِّرِينَ اَلْمَهَرَةِ لَدَيْنَا يَضْمَنُونَ أَنَّ كُلَّ لَقْطَةٍ سَتَكُونُ مُذْهِلَةً.
</div><div>
يَجْلِبَ فَرِيقُنَا اَلْمُتَمَرِّسُ سَنَوَاتٍ مِنْ اَلْخِبْرَةِ وَالْإِبْدَاعِ لِكُلِّ مَشْرُوعٍ، مِمَّا يَضْمَنُ أَنَّ كُلَّ لَقْطَةٍ جَوِّيَّةٍ تَسَلُّطَ اَلضَّوْءِ عَلَى اَلْمِيزَاتِ اَلْفَرِيدَةِ لِعَمَلِكَ بِدِقَّةٍ وَبَرَاعَةٍ. بَدَأَ مِنْ اَلصُّوَرِ اَلْبَانُورَامِيَّةِ اَلشَّامِلَةِ وَحَتَّى اَللَّقَطَاتِ اَلْقَرِيبَةِ اَلْمُعَقَّدَةِ، فَإِنَّنَا نَلْتَقِطُ جَوْهَرُ عَلَامَتِكَ اَلتِّجَارِيَّةِ مِنْ مَنْظُورٍ فَرِيدٍ وَمُقْنِعٍ فِي نَفْسِ اَلْوَقْتِ. تَمَيَّزَ عَنْ اَلْمُنَافَسَةِ وَأَحْدَثَ تَأْثِيرًا لَا يَنْسَى مِنْ خِلَالِ خِدْمَاتِ اَلتَّصْوِيرِ اَلْفُوتُوغْرَافِيِّ بِالْفِيدْيُو وَالتَّصْوِيرِ اَلْفُوتُوغْرَافِيِّ بِاسْتِخْدَامِ اَلطَّائِرَاتِ دُونَ طَيَّارٍ.
</div><div>
دَعْنَا نُسَاعِدْكُ عَلَى جَذْبِ جُمْهُورِكَ وَتَعْزِيزُ عَلَامَتِكَ اَلتِّجَارِيَّةِ وَالِارْتِقَاءِ بِأَعْمَالِكَ إِلَى آفَاقٍ جَدِيدَةٍ مِنْ اَلنَّجَاحِ مِنْ خِلَالِ قُدُرَاتِنَا اَلْبَصَرِيَّةِ اَلَّتِي لَا مَثِيلَ لَهَا فِي سَرْدِ اَلْقِصَصِ. اِتَّصَلَ بِنَا اَلْيَوْمِ لِمَعْرِفَةِ اَلْمَزِيدِ حَوْلَ كَيْفَ يُمْكِنُنَا اَلِارْتِقَاءُ بِأَعْمَالِكَ مِنْ خِلَالِ قُوَّةِ اَلصُّوَرِ اَلْجَوِّيَّةِ.
</div>   </p>
          </div>
          <div className="imageRight">
            <img
              src="./drones/service4.jpg"
              alt="Service 4"
              className="image"
            />
          </div>
        </div>

        <div className="drone-section section5">
          <h2 className="sectionTitle">
          لِمَاذَا تَخْتَارُ شَرِكَةَ اَلنُّخْبَةِ لِلتَّطْوِيرِ اَلرَّقْمِيِّ لِتَلْبِيَةِ اِحْتِيَاجَاتِكَ مِنْ اَلطَّائِرَاتِ اَلْمَسِيرَةِ؟
          </h2>
          <div className="card-container">
            <div className="row">
              <div className="drone-card">
                <div className="cardContent">
                  <strong>تاكيد الجودة:</strong> نحن نؤمن بالعرض
                  فقط الطائرات بدون طيار عالية الجودة التي تم تصميمها لتدوم طويلاً. كل
                  تخضع الطائرة بدون طيار الموجودة في مخزوننا لاختبارات صارمة لضمان ذلك
                  الأداء الأمثل والموثوقية.
                </div>
              </div>
              <div className="drone-card">
                <div className="cardContent">
                  <strong>أسعار تنافسية:</strong> نحن نفهم
                  أهمية البقاء في حدود الميزانية دون المساومة عليها
                  جودة. ولهذا السبب نسعى جاهدين لتقديم أفضل الأسعار لدينا
                  طائرات بدون طيار للمؤسسات، مما يجعلها في متناول الشركات للجميع
                  الأحجام.
                </div>
              </div>
              <div className="drone-card">
                <div className="cardContent">
                  <strong>حلول مخصصة:</strong> لا يوجد شركتان
                  على حد سواء، ولهذا السبب نقدم حلول الطائرات بدون طيار المخصصة
                  مصممة خصيصا لاحتياجاتك المحددة. سواء كنت تحتاج
                  ميزات إضافية أو ملحقات أو عمليات تكامل البرامج،
                  نحن هنا لتلبية متطلباتك الفريدة.
                </div>
              </div>
            </div>
            <div className="row">
              <div className="drone-card">
                <div className="cardContent">
                  <strong>إرشادات الخبراء:</strong>مع سنوات من الخبرة في
                  في صناعة الطائرات بدون طيار، فريق الخبراء لدينا موجود هنا لتزويدك
                  مع التوجيه المعرفة في كل خطوة على الطريق. من
                  اختيار طراز الطائرة بدون طيار المناسب لتقديم الدعم الفني،
                  نحن ملتزمون بمساعدتك على اتخاذ قرارات مستنيرة.
                </div>
              </div>
              <div className="drone-card">
                <div className="cardContent">
                  <strong>خيارات تأجير مرنة:</strong> غير مستعد للالتزام
                  لشراء طائرة بدون طيار بشكل مباشر؟ لا مشكلة. نحن نقدم مرنة
                  خيارات التأجير التي تتيح لك الوصول إلى أحدث طائرة بدون طيار
                  التكنولوجيا دون الاستثمار مقدما. سواء كنت في حاجة الى
                  لدينا طائرة بدون طيار لمشروع لمرة واحدة أو مشروع مستمر
                  قمت بتغطيتها.
                </div>
              </div>
              <div className="drone-card">
                <div className="cardContent">
                  <strong>رضا العملاء:</strong> الارتياح الخاص بك هو
                  أولويتنا القصوى. نحن نفخر بتقديم استثنائي
                  خدمة العملاء والدعم لضمان تجربتك معنا
                  ليس أقل من ممتاز.
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  );
};

export default Drones;
